snlkuharlocal/src/InformationRegisters/Логи/Логи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Логи</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостояниеДокументов/СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеДокументов</name>
  <enumValues>
    <name>НеВыписаны</name>
  </enumValues>
  <enumValues>
    <name>Выписаны</name>
  </enumValues>
  <enumValues>
    <name>ВыписаныПовторно</name>
  </enumValues>
  <enumValues>
    <name>Получены</name>
  </enumValues>
  <enumValues>
    <name>ПолученыСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСумма</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСуммаСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ОшибкиОформления</name>
  </enumValues>
  <enumValues>
    <name>ПолученоИзображение</name>
  </enumValues>
  <enumValues>
    <name>СканСОшибками</name>
  </enumValues>
  <enumValues>
    <name>Проверены</name>
  </enumValues>
  <enumValues>
    <name>ГотовыКОтправкеВОФис</name>
    <comment>готов к отправке в офис из удаленного подразделения</comment>
  </enumValues>
  <enumValues>
    <name>ПолученДокументЗаместитель</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
    <comment>Документ с изменениями, сданный на склад для создания рекламации</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленВОфис</name>
    <comment>Оригинал отправлен в офис по письменному запросу</comment>
  </enumValues>
  <enumValues>
    <name>ВозвращенВАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВПРО</name>
  </enumValues>
  <enumValues>
    <name>ВнесеныИзменения</name>
  </enumValues>
  <enumValues>
    <name>ПолученыВФилиале</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуютВосстановитьНеВозможно</name>
  </enumValues>
  <enumValues>
    <name>ПоДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ПодписанВЭДО</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийРКО/ВидыОперацийРКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРКО</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлаты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РасходДенежныхСредствПрочее</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаУслуг</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйОтчет</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОстаткаПодарочногоСертификата</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПодарочногоСертификата</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийПКО/ВидыОперацийПКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПКО</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПокупателя</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>НедовложениеВИнкассацию</name>
  </enumValues>
  <enumValues>
    <name>ПриходДенежныхСредствПрочее</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовыйОтчет</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийПС/ВидыОперацийПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПС</name>
  <enumValues>
    <name>ПереводДенегВСейф</name>
  </enumValues>
  <enumValues>
    <name>ПереводВЦО</name>
  </enumValues>
  <enumValues>
    <name>ПрочийПеревод</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/CommonModules/ОбщегоНазначенияС/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ОпределитьУровеньНоменклатуры (Номенклатура) Экспорт
	
	Возврат Номенклатура.Уровень();
	
КонецФункции
Процедура ЗаполнитьШапкуДокументаСервер(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено,
	ТипОперации = "") Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ВидДокумента		= МетаданныеДокумента.Имя;

	ОсновнойСклад		= ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
	Если ЕстьРеквизитДокумента("ИБ", МетаданныеДокумента) И ДокументОбъект.ИБ.Пустая() Тогда
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			ТекИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		Иначе
			Если ЗначениеЗаполнено(ОсновнойСклад) И ЗначениеЗаполнено(ОсновнойСклад.ПрефиксИБ) Тогда
				ТекИБ=Справочники.ИБ.НайтиПоКоду(ОсновнойСклад.ПрефиксИБ);
			Иначе
				ТекИБ=ПолучитьИБПоУмолчанию();
			КонецЕсли;
		КонецЕсли;
		УстановитьРеквизитШапки(ДокументОбъект, "ИБ", ТекИБ, МетаданныеДокумента);
	КонецЕсли;

	УстановитьРеквизитШапки(ДокументОбъект, "Автор", ПараметрыСеанса.Пользователь, МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Организация", ПолучитьЗначениеПоУмолчанию(
		"ОсновнаяОрганизация"), МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Отгружен",
		Перечисления.Отгружен.Резерв, МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "СостояниеНакладной",
		Перечисления.СостоянияНакладной.ВРаботе, МетаданныеДокумента);

	Если ВидДокумента = "Чек" Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "ВидОплаты", ПолучитьЗначениеПоУмолчанию(
			"ОсновнойВидОплатыДляЧеков"), МетаданныеДокумента);
		Если ДокументОбъект.ВидОплаты.Пустая() Тогда
			ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.НАЛ;
		КонецЕсли;
	Иначе
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "ВидОплаты", ПолучитьЗначениеПоУмолчанию(
			"ОсновнойВидОплаты"), МетаданныеДокумента);
	КонецЕсли;	
	
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Подразделение", ПодразделениеПоУмолчаниюСервер(),
		МетаданныеДокумента);	
	
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "РабочееМесто", ПараметрыСеанса.РабочееМестоКлиента,
		МетаданныеДокумента);	

	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Склад",
		ОсновнойСклад, МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "СкладОтправитель", ПолучитьЗначениеПоУмолчанию(
		"ОсновнойСклад"), МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Касса", ПолучитьЗначениеПоУмолчанию(
		"ОсновнаяКасса"), МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "СтавкаНДС", ПолучитьЗначениеПоУмолчанию(
		"ОсновнаяСтавкаНДС"), МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "СостояниеДокументов",
		Перечисления.СостояниеДокументов.НеВыписаны, МетаданныеДокумента);

	Если ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокумента) Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "БанковскийСчет",
			ДокументОбъект.Организация.ОсновнойБанковскийСчет, МетаданныеДокумента);
	КонецЕсли;

	Если ТипОперации = "Покупка" Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Валюта", ПолучитьЗначениеПоУмолчанию(
			"ОсновнаяВалютаПокупки"), МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Контрагент", ПолучитьЗначениеПоУмолчанию(
			"ОсновнойПоставщик"), МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "ТипЦен", ПолучитьЗначениеПоУмолчанию(
			"ОсновнойТипЦенПокупки"), МетаданныеДокумента);
	ИначеЕсли ТипОперации = "Продажа" Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Валюта", ПолучитьЗначениеПоУмолчанию(
			"ОсновнаяВалютаПродажи"), МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Контрагент", ПолучитьЗначениеПоУмолчанию(
			"ОсновнойПокупатель"), МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "ТипЦен", ПолучитьЗначениеПоУмолчанию(
			"ОсновнойТипЦенПродажи"), МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Отгружен",
			Перечисления.Отгружен.Резерв, МетаданныеДокумента);
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента) Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) И ТипЗнч(ДокументОбъект.Контрагент) = Тип(
			"СправочникСсылка.Контрагенты") Тогда
			УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Договор",
				ДокументОбъект.Контрагент.ОсновнойДоговор, МетаданныеДокумента);
		КонецЕсли
		;
	КонецЕсли;	
	
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Валюта",
		ПараметрыСеанса.ВалютаНац, МетаданныеДокумента);

	Если ВидДокумента = "ПереводСредств" Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Источник_Контрагент",
			Справочники.ФизическиеЛица.ПустаяСсылка(), МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект, "Получатель_Контрагент",
			Справочники.ФизическиеЛица.ПустаяСсылка(), МетаданныеДокумента);
	КонецЕсли;

	Если ЕстьРеквизитДокумента("Курс", МетаданныеДокумента) И ЕстьРеквизитДокумента("Валюта", МетаданныеДокумента)
		И (ЗначениеНеЗаполнено(ДокументОбъект.Курс)) Тогда
		Доллары=Справочники.Валюты.НайтиПоКоду("840");

		ТекВалюта=?(ДокументОбъект.Валюта = ПараметрыСеанса.ВалютаНац, Доллары, ДокументОбъект.Валюта);//по исторически сложившейся традиции для рублей указывается курс доллара

		СтруктураКурсаДокумента      = ПолучитьКурсВалюты(ТекВалюта, ДокументОбъект.Дата);
		ДокументОбъект.Курс			 = СтруктураКурсаДокумента.Курс;
	КонецЕсли;

	Если ЕстьРеквизитДокумента("Склад", МетаданныеДокумента) И Не ДокументОбъект.Склад.Пустая() Тогда
		Если ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) И ДокументОбъект.Организация.Пустая() Тогда
			ДокументОбъект.Организация=ДокументОбъект.Склад.Организация;
		КонецЕсли;
	КонецЕсли;		
	
	Если ВидДокумента = "РасходныйКассовыйОрдер" Или ВидДокумента = "ПриходныйКассовыйОрдер" Тогда
		УстановитьРеквизитШапки(ДокументОбъект, "Кассир", ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.Пользователь,"ФизЛицо"), МетаданныеДокумента);
	КонецЕсли;
	Если ВидДокумента = "ПереводСредств" Тогда
		УстановитьРеквизитШапки(ДокументОбъект, "Источник_Контрагент", ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.Пользователь,"ФизЛицо"),
			МетаданныеДокумента);
	КонецЕсли;
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если ВидДокумента = "РасходныйКассовыйОрдер" Тогда
			УстановитьРеквизитШапки(ДокументОбъект, "ВидОперации",
				Перечисления.ВидыОперацийРКО.РасходДенежныхСредствПрочее, МетаданныеДокумента);
		ИначеЕсли ВидДокумента = "ПриходныйКассовыйОрдер" Тогда
			УстановитьРеквизитШапки(ДокументОбъект, "ВидОперации",
				Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее, МетаданныеДокумента);
		ИначеЕсли ВидДокумента = "ПереводСредств" Тогда
			УстановитьРеквизитШапки(ДокументОбъект, "ВидОперации", Перечисления.ВидыОперацийПС.ПрочийПеревод,
				МетаданныеДокумента);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПодразделениеПоУмолчаниюСервер()
	Результат = ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделение");
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();					
	КонецЕсли;                                                              
	Возврат Результат;
КонецФункции //ПодразделениеПоУмолчанию()

Функция ПолучитьРеквизитШапкиСервер(Ссылка,ИмяРеквизита,ТипОбъекта=Неопределено) Экспорт
	ПредставлениеРеквизита=СтрЗаменить(ИмяРеквизита,".","_");	
	
	СписокРеквизитов=Новый Соответствие;
	СписокРеквизитов.Вставить(ИмяРеквизита,ПредставлениеРеквизита);
	
	Реквизиты=ПолучитьРеквизитыШапкиСервер(Ссылка,СписокРеквизитов,ТипОбъекта);
	Возврат Реквизиты[ПредставлениеРеквизита];
КонецФункции //ПолучитьРеквизитШапки(Ссылка,ИмяРеквизита,ТипОбъекта=Неопределено) Экспорт

Функция ПолучитьРеквизитыШапкиСервер(ОбъектСсылка,Знач СписокРеквизитов,ТипОбъекта=Неопределено) Экспорт
	Если ТипЗнч(СписокРеквизитов)=Тип("Строка") Тогда
		СписокЭлементов	=СтрРазделить(СписокРеквизитов,",");
		СписокРеквизитов=Новый Соответствие;
		Для Каждого Элемент Из СписокЭлементов Цикл
			СписокРеквизитов.Вставить(Элемент,СтрЗаменить(Элемент,".","_"));		
		КонецЦикла;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка";
	Для Каждого Элемент Из СписокРеквизитов Цикл
		Запрос.Текст=Запрос.Текст+",
		|	"+Элемент.Ключ+" "+?(ПустаяСтрока(Элемент.Значение),"","КАК "+Элемент.Значение);
	КонецЦикла;
	
	Если ТипОбъекта=Неопределено Тогда
		ТипОбъекта=ТипОбъекта(ОбъектСсылка);	
	КонецЕсли;
	
	Результат=Новый Структура;
	Для Каждого Элемент Из СписокРеквизитов Цикл
		Результат.Вставить(?(ПустаяСтрока(Элемент.Значение),Элемент.Ключ,Элемент.Значение),Неопределено);	
	КонецЦикла; 
	Если ПустаяСтрока(ТипОбъекта) Тогда
		Возврат Результат;	
	КонецЕсли; 
	Запрос.Текст=Запрос.Текст+"
	|ИЗ
	|	"+ТипОбъекта+"."+ОбъектСсылка.Метаданные().Имя+"
	|ГДЕ
	|	Ссылка=&ОбъектСсылка";
	Запрос.УстановитьПараметр("ОбъектСсылка",ОбъектСсылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат,Выборка);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьРеквизитыШапки(ОбъектСсылка,СписокРеквизитов) Экспорт

Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.Пользователь; 
КонецФункции

Процедура ЗаписатьВЛогНаСервере(ИмяЛога, Сообщение, ТипСообщения, ВыводитьСообщения = Ложь,
	НастройкиОтчета = Неопределено, ВремяВыполнения = Неопределено) Экспорт
	ПараметрыСеанса.НомерЗаписиЛога=ПараметрыСеанса.НомерЗаписиЛога + 1;

	Запись=РегистрыСведений.Логи.СоздатьМенеджерЗаписи();

	Запись.Дата = ТекущаяДатаСеанса();
	Если Метаданные.РегистрыСведений.Логи.Измерения.Найти("День") <> Неопределено Тогда
		Запись.День=Запись.Дата;
	КонецЕсли;

	Запись.НомерЗаписи	=ПараметрыСеанса.НомерЗаписиЛога;
	Запись.ИмяЛога		=ИмяЛога;
	Запись.Автор		=ПараметрыСеанса.Пользователь;
	Запись.Сообщение	=Сообщение;
	Запись.ТипСообщения	=ТипСообщения;

	Запись.ДопИнфо			= Новый ХранилищеЗначения(НастройкиОтчета, Новый СжатиеДанных(9));
	Запись.ВремяВыполненния = ВремяВыполнения;
	Попытка

		Запись.Записать(Ложь);

	Исключение
		Сообщить(ОписаниеОшибки()); 
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт
	Результат	= ЗначениеПоУмолчанию;
	Если ТипЗнч(СтруктураПараметров)=Тип("Структура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("ДанныеФормыСтруктура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("Соответствие") Тогда
		ВремЗнач=СтруктураПараметров.Получить(Имя);
		Если ВремЗнач<>Неопределено Тогда
			Результат=ВремЗнач;		
		КонецЕсли;				
	КонецЕсли;
	Возврат Результат;
КонецФункции //ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено)

Функция НайтиДокументНаСервере(Вид,СтруктураПоиска) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ."+Вид+"
	|ГДЕ
	|	Истина ";
	
	Для Каждого Элемент Из СтруктураПоиска Цикл
		Если Элемент.Ключ="Дата" Тогда
			Запрос.Текст=Запрос.Текст+"
			|	И НАЧАЛОПЕРИОДА("+Элемент.Ключ+",ГОД)=НАЧАЛОПЕРИОДА(&"+Элемент.Ключ+",ГОД)";
		Иначе
			Запрос.Текст=Запрос.Текст+"
			|	И "+Элемент.Ключ+"=&"+Элемент.Ключ;		
		КонецЕсли;		
		
		Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);
	КонецЦикла;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;			
	КонецЦикла;	
	
	Возврат Документы[Вид].ПустаяСсылка();
КонецФункции

//Кухарь А.Ю 01.06.2026 начало 

Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 


Функция ЗначенияРеквизитовОбъектовСервер(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если ТипЗнч(МассивСсылок) = Тип("Массив") ИЛИ ТипЗнч(МассивСсылок) = Тип("ФиксированныйМассив") Тогда
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		СообщитьОбОшибке("Неверный тип параметра ""МассивСсылок""");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции  

Функция ПолучитьВсеШКТовараСервер(Номенклатура,ТипШК=Неопределено,ВидШК=Неопределено) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка,
	|	ПометкаУдаления,
	|	Предопределенный,
	|	Владелец,
	|	Код,
	|	Наименование,
	|	ТипШК,
	|	ВидШК,
	|	ДатаМодификации,
	|	ПричинаМодификации,
	|	Описание
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	Владелец = &Номенклатура
	|	И Наименование<>""9999999999999""			
	|	И ТипШК = &ТипШК
	|	И ВидШК = &ВидШК";	
	Запрос.УстановитьПараметр("Номенклатура",	Номенклатура);
	Запрос.УстановитьПараметр("ТипШК",			ТипШК);
	Запрос.УстановитьПараметр("ВидШК",			ВидШК);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции 


//Кухарь А.Ю 01.06.2026 конец

//Кухарь А.Ю.  04.06.2026 начало
// Формирует текст запроса для транзитивного замыкания иерархии справочника.
// Вычисляет все возможные связи "предок-потомок" в справочнике с учетом заданной максимальной длины пути.
//
// Параметры:
//  ИмяСправочника      - Строка - имя справочника, для которого формируется запрос
//  МаксимальнаяДлинаПути - Число - максимальная длина пути для замыкания (по умолчанию 10)
//  ТипЗамыкания         - Строка - тип замыкания:
//                        * "УровниИерархии" - возвращает уровни иерархии (количество предков)
//                        * "Прародители"   - возвращает только прародителей (корневые элементы)
//                        * пустая строка   - возвращает все замыкания без самозамыканий (по умолчанию)
//
// Возвращаемое значение:
//  Строка - текст запроса для транзитивного замыкания
//
Функция ПолучитьТекстЗапросаТранзитивногоЗамыканияПоСправочнику(ИмяСправочника, МаксимальнаяДлинаПути = 10, ТипЗамыкания = "") Экспорт 
	
	Пролог = "ВЫБРАТЬ Родитель НачалоДуги, Ссылка КонецДуги ПОМЕСТИТЬ ЗамыканияДлины1 ИЗ Справочник.%1
	|ГДЕ Родитель <> Значение(Справочник.%1.ПустаяСсылка)
	|ОБЪЕДИНИТЬ ВЫБРАТЬ Ссылка, Ссылка ИЗ Справочник.%1;";
	Рефрен = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПерваяДуга.НачалоДуги, ВтораяДуга.КонецДуги ПОМЕСТИТЬ ЗамыканияДлины#2
	|ИЗ ЗамыканияДлины#1 КАК ПерваяДуга
	|СОЕДИНЕНИЕ ЗамыканияДлины#1 КАК ВтораяДуга ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги;
	|УНИЧТОЖИТЬ ЗамыканияДлины#1;";
	Если ТипЗамыкания = "УровниИерархии" Тогда
		Эпилог = "ВЫБРАТЬ КОЛИЧЕСТВО(НачалоДуги) - 1 Предок, КонецДуги Потомок ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ ЗамыканияДлины#2 СГРУППИРОВАТЬ ПО КонецДуги";
	ИначеЕсли ТипЗамыкания = "Прародители" Тогда
		Эпилог = "ВЫБРАТЬ НачалоДуги Предок, КонецДуги Потомок ПОМЕСТИТЬ ТаблицаДанных ИЗ ЗамыканияДлины#2
		|ГДЕ НачалоДуги <> КонецДуги И НачалоДуги.Родитель = Значение(Справочник.%1.ПустаяСсылка)";
	Иначе
		Эпилог = "ВЫБРАТЬ НачалоДуги Предок, КонецДуги Потомок ПОМЕСТИТЬ ТаблицаДанных ИЗ ЗамыканияДлины#2
		|ГДЕ НачалоДуги <> КонецДуги";
	КонецЕсли;
	
	ТекстЗапроса = Пролог;
	МаксимальнаяДлинаЗамыканий = 1;
	Пока МаксимальнаяДлинаЗамыканий < МаксимальнаяДлинаПути Цикл
		ТекстЗапроса = ТекстЗапроса + СтрЗаменить(СтрЗаменить(Рефрен, "#1", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0")),
		"#2", Формат(2 * МаксимальнаяДлинаЗамыканий, "ЧГ=0"));
		МаксимальнаяДлинаЗамыканий = 2 * МаксимальнаяДлинаЗамыканий;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + СтрЗаменить(Эпилог, "#2", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0"));
	
	Возврат СтрШаблон(ТекстЗапроса, ИмяСправочника);
КонецФункции 
//Кухарь А.Ю. 04.06.2026 конец


// Кухарь А.Ю.  17.06.2026 начало
// Изменение 0000000060
// Вычисляет дату оплаты на основе параметров расчета. Учитывает дату отгрузки, отсрочку платежа (в том числе банковские дни) и логистическое плечо из договора.
//
// Параметры:
//  ПараметрыРасчета - Структура - параметры для расчета даты оплаты, должна содержать:
//    * ДатаОтгрузки - Дата - дата отгрузки (может быть Неопределено)
//    * ОтсрочкаПлатежа - СправочникСсылка.ОтсрочкиПлатежа - отсрочка платежа (может быть Неопределено)
//    * Договор - СправочникСсылка.Договоры - договор (может быть Неопределено)
//
// Возвращаемое значение:
//  Дата - дата оплаты. Если дата отгрузки не задана, возвращает 01.01.0001
//
Функция ПолучитьДатуОплатыСервер (ПараметрыРасчета) Экспорт            
	
	ДатаОтгрузки	 = ПараметрыРасчета.ДатаОтгрузки; 
	Если ДатаОтгрузки = Неопределено тогда
		ДатаОтгрузки = Дата(1, 1, 1);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.ОтсрочкаПлатежа) Тогда
		ДанныеОтсрочкиПлатежа  = ОбщегоНазначенияС.ПолучитьРеквизитыШапкиСервер(ПараметрыРасчета.ОтсрочкаПлатежа, "ВидОтсрочки, Отсрочка, Ссылка", "Справочник");
	Иначе      
		ДанныеОтсрочкиПлатежа = Новый Структура ("ВидОтсрочки, Отсрочка, Ссылка", 
		Перечисления.ВидыОтсрочки.ПустаяСсылка(), 0 , Справочники.ОтсрочкиПлатежа.ПустаяСсылка());	
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.Договор) Тогда
		ДанныеДоговора  = ОбщегоНазначенияС.ПолучитьРеквизитыШапкиСервер(ПараметрыРасчета.Договор, "ЛогистическоеПлечо, Ссылка", "Справочник");
	Иначе      
		ДанныеДоговора = Новый Структура ("ЛогистическоеПлечо, Ссылка", 0, Справочники.Договоры.ПустаяСсылка()); 
	КонецЕсли;   
	
	Если ДатаОтгрузки = Дата(1, 1, 1) Тогда
		ДатаОплаты = ДатаОтгрузки;
	Иначе
		Если  ДанныеОтсрочкиПлатежа.ВидОтсрочки = Перечисления.ВидыОтсрочки.БанковскиеДни Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КалендарьДни.Дата КАК Дата
			|ИЗ
			|	Справочник.Календарь.Дни КАК КалендарьДни
			|ГДЕ
			|	КалендарьДни.Дата >= &ДатаОтгрузки
			|	И КалендарьДни.Часы <> 0
			|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
			Выборка = Запрос.Выполнить().Выбрать();
			НПП = 0;
			Пока Выборка.Следующий() Цикл		
				Если НПП = ДанныеОтсрочкиПлатежа.Отсрочка Тогда
					Возврат Выборка.Дата;	
				Конецесли;
				НПП = НПП + 1;
			КонецЦикла;
			
			ДатаОплаты = ДатаОтгрузки + ДанныеОтсрочкиПлатежа.Отсрочка * 24 * 60 * 60;		
		Иначе		
			ДатаОплаты =  ДатаОтгрузки + ДанныеОтсрочкиПлатежа.Отсрочка * 24 * 60 * 60;
		КонецЕсли;
	КонецЕсли;
	
	если ДатаОплаты <> Дата(1, 1, 1) тогда
		ДатаОплаты 	= ДатаОплаты + ДанныеДоговора.ЛогистическоеПлечо * 24 * 60 * 60;
	КонецЕсли;          
	
	Возврат ДатаОплаты;
	
КонецФункции

//--Данилова Е.В. 02.07.2026   



Функция ПрочитатьРСРеквизитСправочникаСервер(Знач ИмяРеквизита, Знач СправочникСсылка, ПустоеЗначение=Неопределено) Экспорт
	
	Результат = ПустоеЗначение;
	
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ Первые 1
				  |	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
				  |ИЗ
				  |	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
				  |ГДЕ
				  |	РеквизитыСправочников.Справочник = &СправочникСсылка
				  |	И РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	Запрос.УстановитьПараметр("СправочникСсылка", СправочникСсылка);
	Выборка=Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Результат = Выборка.ЗначениеРеквизита;
	КонецЦикла;

	Возврат Результат;
	
КонецФункции
// Кухарь А.Ю.  17.06.2026 конец

//++Данилова Е.В. 02.07.2026 Изм.№0000000174

// Устанавливает номер документа в соответствии с правилами нумерации конфигурации.
// Определяет префикс нумерации в зависимости от типа документа, организации, склада и типа узла ИБ.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ, для которого устанавливается номер
//
Процедура УстановитьНомерДокументаСервер(ДокументОбъект) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	ДопБуква = "";

	Если МетаданныеДокумента.Имя = "РасходнаяНакладная" Тогда

		Если ДокументОбъект.Дата >= '20250101' Тогда

			ДопБуква = "";

		ИначеЕсли ДокументОбъект.Дата >= '20200101' Тогда

			ДопБуква = "б";

		Иначе

			ДопБуква = ?(ДокументОбъект.ВидОплаты = Перечисления.ВидыОплаты.БН, "б", "а");

		КонецЕсли;

	ИначеЕсли МетаданныеДокумента.Имя = "ОтчетКассовойСмены" Тогда

		ДопБуква = ?(ДокументОбъект.ВидОплаты = Перечисления.ВидыОплаты.БН, "кб", "кн");

	КонецЕсли;

	Вид = МетаданныеДокумента.Имя;

	Если Вид = "ЛистНабора" Или Вид = "ЛистПереукладки" Тогда

		НомерДокумента = ПолучитьРеквизитШапкиСервер(ДокументОбъект.ДокОснование, "Номер");

		ИмяДокумента = СокрЛП(НомерДокумента);

		ТипДокОсн = ДокументОбъект.ДокОснование.Метаданные().Имя;

		Если ТипДокОсн = "Инвентаризация" Тогда

			ИмяДокумента = "" + ИмяДокумента + "i";
			ИмяДокумента = Лев(ИмяДокумента, 4) + Сред(ИмяДокумента, 6, СтрДлина(ИмяДокумента)) + "/";

			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ИмяДокумента));

		Иначе

			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(НомерДокумента) + "/");

		КонецЕсли;

	ИначеЕсли Вид = "КорректировочныйСчетФактура" Тогда

		Попытка

			НакладнаяРНК = ПолучитьРеквизитШапкиСервер(ДокументОбъект.накладные[0], "накладная");
			ДокОснование = ПолучитьРеквизитШапкиСервер(НакладнаяРНК, "докоснование");
			ДокРНК       = ПолучитьРеквизитШапкиСервер(ДокОснование, "ссылка");

		Исключение

			Сообщить("Сначала сохраните документ!");

		КонецПопытки;

		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда

			Префикс = ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.ЭтотУзел, "Код");

			ПрефиксСклада = СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад, "Префикс"));

			Префикс = Префикс + ПрефиксСклада;

			ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация, "Префикс");

			Если ДокументОбъект.Организация <> Справочники.Организации.НайтиПоКоду("SS-001") И Не ПустаяСтрока(
				ПрефиксОрганизации) Тогда

				Префикс = Лев(ПрефиксОрганизации, 1) + Прав(Префикс, СтрДлина(Префикс) - 1);

			КонецЕсли;

		Иначе

			ПрефиксКонтрагента = "";

			Если ДокументОбъект.Накладные.Количество() > 0 Тогда

				Накладная 		= ПолучитьРеквизитШапкиСервер(ДокументОбъект.Накладные[0],
					"Накладная");
				ПунктДоставки	= ПолучитьРеквизитШапкиСервер(Накладная, "ПунктДоставки");
				ПрефиксСФ  		= ПолучитьРеквизитШапкиСервер(ПунктДоставки, "ПрефиксСФ");

				Если ЕстьРеквизитДокумента("ПунктДоставки", Накладная.Метаданные()) И ЗначениеЗаполнено(ПрефиксСФ) Тогда

					ПрефиксКонтрагента = СокрЛП(ПрефиксСФ);

				КонецЕсли;

			КонецЕсли;

			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда

				ПрефиксКонтрагента = СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент, "ПрефиксСФ"));

			КонецЕсли;

			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда

				ПрефиксСклада	= СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад,
					"Префикс")); 				

				//@skip-check empty-except-statement
				Попытка

					ДокРКМ = ПолучитьРеквизитШапкиСервер(ДокументОбъект.накладные[0], "Накладная");

					ДокументВозврата = ПолучитьРеквизитШапкиСервер(ДокРКМ, "ДокументВозврата");

					Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение
						И ДокРКМ.Метаданные().Имя = "РекламационнаяНакладная" И Не (ДокументВозврата.Пустая()) Тогда

						ПрефиксСклада = "v";

					КонецЕсли;

				Исключение

				КонецПопытки;

				ПрефиксИБ = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад, "ПрефиксИБ");

				Если ПрефиксИБ = "SNL" Тогда

					Префикс = ПрефиксИБ;

				Иначе

					ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация,
						"Префикс");

					КодИБ = ПолучитьРеквизитШапкиСервер(ДокументОбъект.ИБ, "Код");

					Префикс = ?(Не ПустаяСтрока(ПрефиксОрганизации), СокрЛП(
						ПрефиксОрганизации) + ПрефиксСклада, КодИБ);

				КонецЕсли;

			Иначе

				ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация,
					"Префикс");

				КодИБ = ПолучитьРеквизитШапкиСервер(ДокументОбъект.ИБ, "Код");

				Префикс = ?(Не ПустаяСтрока(ПрефиксОрганизации), СокрЛП(
					ПрефиксОрганизации) + ПрефиксКонтрагента, КодИБ);

			КонецЕсли;

		КонецЕсли;

		Если ПерваяСФ(Префикс, ДокументОбъект.Дата) Тогда

			КоличествоПропусков = 1;

		Иначе

			КоличествоПропусков=0;

		КонецЕсли;

		УстановитьНормальныйНовыйНомер(ДокументОбъект, Префикс + "-", КоличествоПропусков);

	ИначеЕсли Вид = "СчетФактура" Тогда

		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда

			Префикс = ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.ЭтотУзел, "Код");

			ПрефиксСклада = СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад, "Префикс"));

			Префикс = Префикс + ПрефиксСклада;

			ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация, "Префикс");

			Если ДокументОбъект.Организация <> Справочники.Организации.НайтиПоКоду("SS-001") И Не ПустаяСтрока(
				ПрефиксОрганизации) Тогда

				Префикс = Лев(ПрефиксОрганизации, 1) + Прав(Префикс, СтрДлина(Префикс) - 1);

			КонецЕсли;

		Иначе
			ПрефиксКонтрагента = "";

			Если ДокументОбъект.Накладные.Количество() > 0 Тогда
				Накладная = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Накладные[0], "Накладная");

				Если ЕстьРеквизитДокумента("ПунктДоставки", Накладная.Метаданные()) Тогда

					ПунктДоставки = ПолучитьРеквизитШапкиСервер(Накладная, "ПунктДоставки");
					ПрефиксСФ = ПолучитьРеквизитШапкиСервер(ПунктДоставки, "ПрефиксСФ");

					Если ЗначениеЗаполнено(ПрефиксСФ) Тогда

						ПрефиксКонтрагента = СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда

				ПрефиксКонтрагента = СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент, "ПрефиксСФ"));

			КонецЕсли;

			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда

				ПрефиксСклада = СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад, "Префикс"));
				ПрефиксИБ = СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад, "ПрефиксИБ"));

				Если ПрефиксИБ = "SNL" Тогда

					Префикс = ПрефиксИБ;

				Иначе

					ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация,
						"Префикс");
					КодИБ = ПолучитьРеквизитШапкиСервер(ДокументОбъект.ИБ, "Код");

					Префикс = ?(Не ПустаяСтрока(ПрефиксОрганизации), СокрЛП(
						ПрефиксОрганизации) + ПрефиксСклада, КодИБ);

				КонецЕсли;

			Иначе

				ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация,
					"Префикс");

				КодИБ = ПолучитьРеквизитШапкиСервер(ДокументОбъект.ИБ, "Код");

				Префикс = ?(Не ПустаяСтрока(ПрефиксОрганизации), СокрЛП(
					ПрефиксОрганизации) + ПрефиксКонтрагента, КодИБ);

			КонецЕсли;

		КонецЕсли;

		Если ПерваяСФ(Префикс, ДокументОбъект.Дата) Тогда

			КоличествоПропусков = 1;

		Иначе

			КоличествоПропусков = 0;

		КонецЕсли;

		УстановитьНормальныйНовыйНомер(ДокументОбъект, Префикс + "-", КоличествоПропусков);

	ИначеЕсли ЕстьРеквизитДокумента("ИБ", МетаданныеДокумента) Тогда

		ЭтотУзел = ПараметрыСеанса.ЭтотУзел;

		Если ЕстьРеквизитДокумента("Склад", МетаданныеДокумента) Тогда

			ПрефиксИБ = СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад, "ПрефиксИБ"));

		КонецЕсли;

		ПрефиксИБ = ОбщегоНазначения_ПИ.ПолучитьПрефиксПоДатеИУзлу(НачалоГода(ДокументОбъект.Дата), ЭтотУзел);

		КодИБ = ПрефиксИБ;

		Если МетаданныеДокумента.Имя = "Заказ" Тогда

			Если ЕстьРеквизитДокумента("Склад", МетаданныеДокумента) Тогда

				ПрефиксИБ = СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад, "ПрефиксИБ"));

			КонецЕсли;

			Если ПустаяСтрока(ПрефиксИБ) Тогда

				ПрефиксИБ = СокрЛП(ПолучитьРеквизитШапкиСервер(ДокументОбъект.ИБ, "Код"));

			КонецЕсли;

			РеквизитыУзла = ПолучитьРеквизитыШапкиСервер(ЭтотУзел, "ТипУзла,Код");

			КодИБ = ?(РеквизитыУзла.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение, ПрефиксИБ,
				РеквизитыУзла.Код);

		КонецЕсли;

		Если МетаданныеДокумента.Имя = "РекомендованныйОстаток" Тогда

			ПрефиксИБ = "";

			КодИБ = ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.ЭтотУзел, "Код");

		КонецЕсли;

		Если МетаданныеДокумента.Имя = "ПриходнаяНакладная" И (КодИБ = "SSP" Или КодИБ = "SST" Или КодИБ = "SSV") Тогда

			ДокументОбъект.УстановитьНовыйНомер(КодИБ + "-0");

		ИначеЕсли МетаданныеДокумента.Имя = "ПланНабора" Тогда

			Если КодИБ = "OD7" И ДеньГода(ТекущаяДатаСеанса()) > 180 Тогда

				КодИБ = "OD8";

			КонецЕсли;

			ДокументОбъект.УстановитьНовыйНомер(КодИБ + "_");

		Иначе

			ДокументОбъект.УстановитьНовыйНомер(КодИБ + ДопБуква + "-");

		КонецЕсли;

	ИначеЕсли Вид = "УслугиСтороннихОрганизаций" Или Вид = "СчетЗаДоставку" Или Вид
		= "НоменклатурноеПриложениеКПаллете" Тогда

		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда

			ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация, "Префикс");

			Префикс = ПрефиксОрганизации + "-";

		Иначе

			КодУзла = ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.ЭтотУзел, "Код");

			Префикс = КодУзла + "-";

		КонецЕсли;

		ДокументОбъект.УстановитьНовыйНомер(Префикс);

	ИначеЕсли Вид = "АвансовыйОтчет" Тогда

		Если ДокументОбъект.ВидОплаты = Перечисления.ВидыОплаты.БН Тогда

			ПрефиксОрганизации = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Организация, "Префикс");

			Префикс = ПрефиксОрганизации + "-";

		Иначе

			Префикс = ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.ЭтотУзел, "Код");

		КонецЕсли;

		ДокументОбъект.УстановитьНовыйНомер(Префикс);

	Иначе

		КодИБ = ПолучитьРеквизитШапкиСервер(ПараметрыСеанса.ЭтотУзел, "Код");

		ДокументОбъект.УстановитьНовыйНомер(КодИБ + "-");

	КонецЕсли;

КонецПроцедуры // УстановитьНомерДокумента()

Функция ПерваяСФ(Префикс,Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер", Префикс + "%");		
	
	Возврат Запрос.Выполнить().Пустой();

КонецФункции
	
Процедура УстановитьНормальныйНовыйНомер(ДокументОбъект, Префикс, КоличествоПропусков = 0)

	МетаДок 	= 	ДокументОбъект.Метаданные();
	
	ДлинаЧисловойЧасти	= МетаДок.ДлинаНомера - СтрДлина(СокрЛП(Префикс));
		
	Если МетаДок.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда

		Дата1 = НачалоГода(ДокументОбъект.Дата);
		Дата2 = КонецГода(ДокументОбъект.Дата);

	ИначеЕсли МетаДок.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда

		Дата1 = НачалоКвартала(ДокументОбъект.Дата);
		Дата2 = КонецКвартала(ДокументОбъект.Дата);

	ИначеЕсли МетаДок.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда

		Дата1 = НачалоМесяца(ДокументОбъект.Дата);
		Дата2 = КонецМесяца(ДокументОбъект.Дата);

	ИначеЕсли МетаДок.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда

		Дата1 = НачалоДня(ДокументОбъект.Дата);
		Дата2 = КонецДня(ДокументОбъект.Дата);

	Иначе

		Дата1 = Неопределено;
		Дата2 = Неопределено;

	КонецЕсли;

	Шаблон = СокрЛП(Префикс);
	
	Для Сч = 1 По ДлинаЧисловойЧасти Цикл

		Шаблон = Шаблон + "[0-9]";

	КонецЦикла;

	Если МетаДок.Имя = "ПланНабора" И ДеньГода(ТекущаяДатаСеанса()) > 180 Тогда

		Префикс = "OD8";

	КонецЕсли;
	Запрос = Новый Запрос;

	Если МетаДок.Имя = "СчетФактура" Или МетаДок.Имя = "КорректировочныйСчетФактура" Тогда

		Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
					 |	МАКСИМУМ(СчетФактура.Номер) КАК Номер
					 |ИЗ
					 |	Документ.СчетФактура КАК СчетФактура
					 |ГДЕ
					 |	" + ?(Дата1 = Неопределено, "", "Дата МЕЖДУ &Дата1 И &Дата2 И ") + "
					 |	СчетФактура.Номер ПОДОБНО &Шаблон
					 |
					 |ОБЪЕДИНИТЬ ВСЕ
					 |
					 |ВЫБРАТЬ
					 |	МАКСИМУМ(КорректировочныйСчетФактура.Номер)
					 |ИЗ
					 |	Документ.КорректировочныйСчетФактура КАК КорректировочныйСчетФактура
					 |ГДЕ
					 |	" + ?(Дата1 = Неопределено, "", "Дата МЕЖДУ &Дата1 И &Дата2 И ") + "
					 |	КорректировочныйСчетФактура.Номер ПОДОБНО &Шаблон
					 |
					 |УПОРЯДОЧИТЬ ПО
					 |	Номер УБЫВ";

	Иначе
		
		Запрос.Текст="
					 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
					 |	МАКСИМУМ(Номер) КАК Номер
					 |ИЗ
					 |	Документ." + МетаДок.Имя + "
					 |ГДЕ
					 |	" + ?(Дата1 = Неопределено, "",	"Дата МЕЖДУ &Дата1 И &Дата2 И ") + "
					 |	Номер ПОДОБНО &Шаблон";

	КонецЕсли;

	Запрос.УстановитьПараметр("Шаблон", Шаблон);

	Если Дата1 <> Неопределено Тогда

		Запрос.УстановитьПараметр("Дата1", Дата1);
		Запрос.УстановитьПараметр("Дата2", Дата2);

	КонецЕсли;

	НомерДока	= Неопределено;
	ПоследнийНомер = 0;

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Если ЗначениеЗаполнено(Выборка.Номер) Тогда

			НомерДока		= Выборка.Номер;
			ПоследнийНомер	= Число(СтрЗаменить(Выборка.Номер, СокрЛП(Префикс), ""));

		КонецЕсли;

	КонецЕсли;

	Коэффициент = 1;

	Если КоличествоПропусков = 1 Тогда

		КоличествоПропусков = 0;

		ПоследнийДок = Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока, ДокументОбъект.Дата);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	ПропускСФ.КоличествоПропусков,
					   |	ПропускСФ.Дата,
					   |	ПропускСФ.ТипСклада
					   |ИЗ
					   |	Справочник.ПропускСФ КАК ПропускСФ
					   |ГДЕ
					   |	(НЕ ПропускСФ.ПометкаУдаления)
					   |	И ПропускСФ.ТипСклада = &ТипСклада
					   |	И ПропускСФ.Дата МЕЖДУ &Дата1 И &Дата2";

		Если Дата1 <> Неопределено Тогда

			Если ПоследнийДок <> Документы[МетаДок.Имя].ПустаяСсылка() Тогда
				
				Запрос.УстановитьПараметр("Дата1", КонецДня(ПоследнийДок.Дата) + 1);
			
			Иначе
				
				Запрос.УстановитьПараметр("Дата1", КонецДня(НачалоГода(ДокументОбъект.Дата)));
			
			КонецЕсли;

			Запрос.УстановитьПараметр("Дата2", КонецДня(ДокументОбъект.Дата));

		КонецЕсли;

		Если Лев(Префикс, 2) = "КБ" Тогда
			
			Запрос.УстановитьПараметр("ТипСклада", Перечисления.ТипСклада.КБСтиль);
		
		Иначе
			
			ТипСклада = ПолучитьРеквизитШапкиСервер(ДокументОбъект.Склад,"ТипСклада");
			 
			Запрос.УстановитьПараметр("ТипСклада", ТипСклада);
		
		КонецЕсли;

		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл
			
			КоличествоПропусков = Выборка.КоличествоПропусков + КоличествоПропусков;
		
		КонецЦикла;

	КонецЕсли;

	ДокументОбъект.Номер = СокрЛП(Префикс) + Формат(ПоследнийНомер + 1 + КоличествоПропусков * Коэффициент, "ЧЦ="
		+ ДлинаЧисловойЧасти + "; ЧВН=");

КонецПроцедуры


#КонецОбласти
